README для Mattermost бота для получения последних тегов
Функции

	•	Получает посты из канала Mattermost.
	•	Извлекает теги версий (например, frontend, backend, clickhouse) из постов.
	•	Форматирует извлеченные теги в удобочитаемый формат.
	•	Выводит команду make для обновления указанного реестра с последними тегами.

Требования

	•	Рабочий экземпляр Mattermost.
	•	Аккаунт бота в Mattermost с соответствующими правами доступа.
	•	Установленный язык программирования Go для запуска сервера.

Настройка

1. URL сервера Mattermost и токен бота

Для настройки бота необходимо указать URL сервера Mattermost и токен бота.

2. Теги по умолчанию

Бот использует следующие теги и метки по умолчанию для идентификации различных сервисов

3. Go build

go build -o mattermost-bot
